console.table(countries);

function getAvaragePopulation() {
    //в каждой стране есть поле population, вернуть из функции среднее арифм.
}

function getNames() {
    //вернуть список (массив) имен стран (поле name)
}

function findCountry() {
    //ввод через prompt название страны, вернуть true если такая страна нашлась по имени, false если не нашлась. можно использовать для этого getNames выше + indexOf
}

function getCountryByCode() {
    //пользователь вводит через prompt трехбуквенный код. если введенная строка не 3 символа длиной - выдать сообщение о неправильном вводе.
    //по введенной строке (трехбуквенный код) найти страну (должно совпадать с alpha3Code, которое есть у каждой страны).
    //и вернуть из функции либо объект с найденной страной, либо false
}

//Удачи.